Repository: zizicici/Doufu
Catalog: Doufu/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# capability.activity_log.detail.allowed
source: Allowed
zh_hans: 已允许
zh_hk: 已允許

# capability.activity_log.detail.denied
source: Denied
zh_hans: 已拒绝
zh_hk: 已拒絕

# capability.activity_log.empty
source: No activity yet
zh_hans: 暂无活动记录
zh_hk: 暫無活動記錄

# capability.activity_log.event.changed
source: Changed
zh_hans: 权限变更
zh_hk: 權限變更

# capability.activity_log.event.requested
source: Requested
zh_hans: 请求授权
zh_hk: 請求授權

# capability.activity_log.event.service_used
source: Used
zh_hans: 使用服务
zh_hk: 使用服務

# capability.activity_log.title
source: Activity Log
zh_hans: 活动记录
zh_hk: 活動記錄

# capability.detail.no_projects
source: No projects have requested this permission.
zh_hans: 暂无项目请求此权限
zh_hk: 暫無項目請求此權限

# capability.detail.section.projects
source: Projects
zh_hans: 项目
zh_hk: 項目

# capability.detail.section.system
source: System
zh_hans: 系统
zh_hk: 系統

# capability.detail.system_permission
source: System Permission
zh_hans: 系统权限
zh_hk: 系統權限

# capability.error.project_denied
source: Permission denied by user.
zh_hans: 权限已被用户拒绝。
zh_hk: 權限已被用戶拒絕。

# capability.error.system_denied_format
source: System permission denied. Please allow Doufu to access %@ in Settings.
zh_hans: 系统权限被拒绝，请在系统设置中允许豆腐访问%@。
zh_hk: 系統權限被拒絕，請在系統設定中允許豆腐存取%@。

# capability.name.camera
source: Camera
zh_hans: 相机
zh_hk: 相機

# capability.name.clipboard_read
source: Read Clipboard
zh_hans: 读取剪贴板
zh_hk: 讀取剪貼簿

# capability.name.clipboard_write
source: Write Clipboard
zh_hans: 写入剪贴板
zh_hk: 寫入剪貼簿

# capability.name.location
source: Location
zh_hans: 位置
zh_hk: 位置

# capability.name.microphone
source: Microphone
zh_hans: 麦克风
zh_hk: 麥克風

# capability.name.photo_pick
source: Pick Photos
zh_hans: 选取照片
zh_hk: 揀選相片

# capability.name.photo_save
source: Save Photos
zh_hans: 保存照片
zh_hk: 儲存相片

# capability.prompt.allow
source: Allow
zh_hans: 允许
zh_hk: 允許

# capability.prompt.deny
source: Deny
zh_hans: 拒绝
zh_hk: 拒絕

# capability.prompt.title_format
source: "%@" requests access to %@
zh_hans: 「%@」请求使用%@
zh_hk: 「%@」請求使用%@

# capability.state.allowed
source: Allowed
zh_hans: 已允许
zh_hk: 已允許

# capability.state.denied
source: Denied
zh_hans: 已拒绝
zh_hk: 已拒絕

# capability.state.not_requested
source: Not Requested
zh_hans: 未请求
zh_hk: 未請求

# chat_service.error.invalid_patch_json
source: Model did not return valid JSON patch data.
zh_hans: 模型未返回可解析的 JSON 变更。
zh_hk: 模型未返回可解析的 JSON 變更。

# chat_service.error.invalid_path_format
source: Model returned an unsafe file path: %@
zh_hans: 模型返回了不安全的文件路径：%@
zh_hk: 模型返回了不安全的文件路徑：%@

# chat_service.error.invalid_response
source: Invalid model response format. Please try again.
zh_hans: 模型响应格式无效，请重试。
zh_hk: 模型響應格式無效，請重試。

# chat_service.error.no_project_files
source: Project directory is empty; cannot build context.
zh_hans: 项目目录为空，无法生成上下文。
zh_hk: 項目目錄為空，無法生成上下文。

# chat.action.cancel
source: Cancel
zh_hans: 取消
zh_hk: 取消

# chat.action.send
source: Send
zh_hans: 发送
zh_hk: 發送

# chat.alert.enter_model_id.message
source: No official or custom models are available for this provider yet. Enter a model ID to continue.
zh_hans: 该供应商暂无官方或自定义模型。请输入模型 ID 以继续。
zh_hk: 該供應商暫無官方或自訂模型。請輸入模型 ID 以繼續。

# chat.alert.enter_model_id.save
source: Save and Continue
zh_hans: 保存并继续
zh_hk: 儲存並繼續

# chat.alert.enter_model_id.title
source: Enter Model ID
zh_hans: 输入模型 ID
zh_hk: 輸入模型 ID

# chat.alert.model_required.message
source: Enter a model ID to continue.
zh_hans: 请输入模型 ID 以继续。
zh_hk: 請輸入模型 ID 以繼續。

# chat.alert.model_required.title
source: Model Required
zh_hans: 需要模型
zh_hk: 需要模型

# chat.alert.no_default_model.action
source: Select Model
zh_hans: 选择模型
zh_hk: 選擇模型

# chat.alert.no_default_model.message
source: No model is selected for this conversation. Please select a model first.
zh_hans: 当前会话未选择模型，请先选择一个模型。
zh_hk: 當前會話未選擇模型，請先選擇一個模型。

# chat.alert.no_default_model.title
source: No Model Selected
zh_hans: 未选择模型
zh_hk: 未選擇模型

# chat.alert.save_failed.title
source: Save Failed
zh_hans: 保存失败
zh_hk: 儲存失敗

# chat.duration.minutes_seconds_format
source: Elapsed %dm %.1fs
zh_hans: 耗时 %dm %.1fs
zh_hk: 耗時 %dm %.1fs

# chat.duration.ms_format
source: Elapsed %dms
zh_hans: 耗时 %dms
zh_hk: 耗時 %dms

# chat.duration.seconds_format
source: Elapsed %.1fs
zh_hans: 耗时 %.1fs
zh_hk: 耗時 %.1fs

# chat.error.no_provider
source: No provider available. Please add an API Key or OAuth provider in Settings first.
zh_hans: 没有可用的提供商。请先在设置中添加 API Key 或 OAuth 提供商。
zh_hk: 沒有可用的提供商。請先在設置中添加 API Key 或 OAuth 提供商。

# chat.error.no_thread
source: No thread available. Please create a thread first.
zh_hans: 没有可用线程，请先创建线程。
zh_hk: 沒有可用線程，請先創建線程。

# chat.input.placeholder
source: Describe what you want to modify
zh_hans: 描述你想让 AI 修改的内容
zh_hk: 描述你想讓 AI 修改的內容

# chat.menu.manage_threads
source: Manage Threads
zh_hans: 管理线程
zh_hk: 管理線程

# chat.menu.model
source: Model
zh_hans: 模型
zh_hk: 模型

# chat.menu.new_thread
source: New Thread
zh_hans: 新建线程
zh_hk: 新建線程

# chat.menu.no_models_available
source: No models available
zh_hans: 没有可用的模型
zh_hk: 沒有可用的模型

# chat.menu.no_thread
source: No Threads
zh_hans: 暂无线程
zh_hk: 暫無線程

# chat.menu.provider
source: Provider
zh_hans: 服务商
zh_hk: 服務商

# chat.menu.reasoning
source: Reasoning
zh_hans: 推理
zh_hk: 推理

# chat.menu.reasoning_for_model_format
source: Reasoning (%@)
zh_hans: 推理（%@）
zh_hk: 推理（%@）

# chat.menu.thinking
source: Thinking
zh_hans: 思考
zh_hk: 思考

# chat.menu.use_model
source: Use This Model
zh_hans: 使用此模型
zh_hk: 使用此模型

# chat.menu.use_provider
source: Use This Provider
zh_hans: 使用此服务商
zh_hk: 使用此服務商

# chat.meta.completed
source: Completed
zh_hans: 已完成
zh_hk: 已完成

# chat.meta.in_progress
source: In progress
zh_hans: 执行中
zh_hk: 執行中

# chat.model_selection.default_suffix
source: (Default)
zh_hans: （默认）
zh_hk: （預設）

# chat.model_selection.invalid.app
source: Invalid App Default
zh_hans: 应用默认模型无效
zh_hk: 應用預設模型無效

# chat.model_selection.invalid.fix_hint
source: Open model settings to change the model or use the default.
zh_hans: 打开模型设置以更换模型或使用默认设置。
zh_hk: 打開模型設定以更換模型或使用預設。

# chat.model_selection.invalid.generic
source: Invalid Model Selection
zh_hans: 模型选择无效
zh_hk: 模型選擇無效

# chat.model_selection.invalid.project
source: Invalid Project Default
zh_hans: 项目默认模型无效
zh_hk: 項目預設模型無效

# chat.model_selection.invalid.short
source: Invalid Model
zh_hans: 模型无效
zh_hk: 模型無效

# chat.model_selection.invalid.thread
source: Invalid Thread Selection
zh_hans: 会话模型选择无效
zh_hk: 會話模型選擇無效

# chat.model_selection.manage_provider
source: Fix provider credentials or add providers.
zh_hans: 修复供应商凭证或添加新的供应商。
zh_hk: 修復供應商憑證或新增供應商。

# chat.model_selection.missing
source: Missing Model Selection. Choose a model before sending.
zh_hans: 未选择模型。请在发送前选择一个模型。
zh_hk: 未選擇模型。請在傳送前選擇一個模型。

# chat.model_selection.missing.short
source: Missing Model Selection
zh_hans: 未选择模型
zh_hk: 未選擇模型

# chat.model_selection.provider_unavailable
source: Credential unavailable
zh_hans: 凭证不可用
zh_hk: 憑證不可用

# chat.model_selection.provider_unavailable.fix_hint
source: Configure this provider before refreshing models.
zh_hans: 请先配置此供应商，再刷新模型列表。
zh_hk: 請先設定此供應商，再重新整理模型清單。

# chat.progress.file_edited_format
source: Edited: %@ (%d/%d applied)
zh_hans: 已编辑：%@（%d/%d 成功）
zh_hk: 已編輯：%@（%d/%d 成功）

# chat.progress.file_read_format
source: Read: %@ (%d lines)
zh_hans: 已读取：%@（%d 行）
zh_hk: 已讀取：%@（%d 行）

# chat.progress.search_completed_format
source: %@ (%d results)
zh_hans: %@（%d 个结果）
zh_hk: %@（%d 個結果）

# chat.project_usage.daily_empty
source: No daily token usage yet for this project.
zh_hans: 这个项目暂时还没有每日 Token 使用记录。
zh_hk: 這個項目暫時還沒有每日 Token 使用記錄。

# chat.project_usage.daily_usage
source: Daily Usage
zh_hans: 每日使用量
zh_hk: 每日使用量

# chat.project_usage.deleted_model
source: Deleted Model
zh_hans: 已删除模型
zh_hk: 已刪除模型

# chat.project_usage.deleted_provider
source: Deleted Provider
zh_hans: 已删除服务商
zh_hk: 已刪除服務商

# chat.project_usage.title
source: Project Total Usage
zh_hans: 项目总用量
zh_hk: 項目總用量

# chat.reasoning.high
source: High
zh_hans: 高
zh_hk: 高

# chat.reasoning.low
source: Low
zh_hans: 低
zh_hk: 低

# chat.reasoning.medium
source: Medium
zh_hans: 中
zh_hk: 中

# chat.reasoning.xhigh
source: XHigh
zh_hans: 超高
zh_hk: 超高

# chat.role.assistant_prefix
source: Assistant
zh_hans: 助手
zh_hk: 助手

# chat.role.system_prefix
source: System
zh_hans: 系统
zh_hk: 系統

# chat.role.user_prefix
source: You
zh_hans: 你
zh_hk: 你

# chat.setup_alert.action.read_only
source: Read Only
zh_hans: 只读模式
zh_hk: 唯讀模式

# chat.setup_alert.action.setup
source: Set Up
zh_hans: 去设置
zh_hk: 去設定

# chat.setup_alert.message
source: You need to configure an LLM provider before using chat. Set up now?
zh_hans: 使用聊天前需要先配置 LLM 供应商。现在设置？
zh_hk: 使用聊天前需要先設定 LLM 供應商。現在設定？

# chat.setup_alert.message.credentials_unavailable
source: Configured providers were found, but their credentials are unavailable. Open Setup to fix them, or continue in read-only mode.
zh_hans: 已发现已配置的供应商，但其凭证当前不可用。你可以进入设置修复，或继续以只读模式打开聊天。
zh_hk: 已發現已設定的供應商，但其憑證目前不可用。你可以前往設定修復，或繼續以唯讀模式開啟聊天。

# chat.setup_alert.title
source: LLM Not Configured
zh_hans: 尚未配置 LLM
zh_hk: 尚未設定 LLM

# chat.storage.alert.title
source: Chat Storage Error
zh_hans: 聊天存储错误
zh_hk: 聊天儲存錯誤

# chat.streaming.char_count_format
source: (%@ chars)
zh_hans: （%@ 字符）
zh_hk: （%@ 字元）

# chat.system.checkpoint_restored.new_thread
source: Checkpoint restored. Started a new chat thread so the conversation matches the restored project state.
zh_hans: 已恢复检查点。已开启新的聊天线程，使对话上下文与恢复后的项目状态保持一致。
zh_hk: 已還原檢查點。已開啟新的聊天線程，使對話上下文與還原後的專案狀態保持一致。

# chat.system.files_updated.append_format
source: \n\nUpdated files: %@
zh_hans: \n\n已更新文件：%@
zh_hk: \n\n已更新文件：%@

# chat.system.memory_update_failed.message_format
source: Failed to update thread memory: %@
zh_hans: 线程记忆更新失败：%@
zh_hk: 線程記憶更新失敗：%@

# chat.system.no_default_model
source: No default model is configured. Please tap the model button in the toolbar to select a model, or set a default model in Settings.
zh_hans: 尚未配置默认模型。请点击工具栏的模型按钮选择模型，或在「设置」中设置默认模型。
zh_hk: 尚未設定預設模型。請點擊工具列的模型按鈕選擇模型，或在「設定」中設定預設模型。

# chat.system.no_provider
source: No LLM provider is configured. Please add a provider to get started.
zh_hans: 尚未配置 LLM 提供商，请先添加一个提供商。
zh_hk: 尚未設定 LLM 提供商，請先新增一個提供商。

# chat.system.provider_connected.message_format
source: Connected to provider "%@". You can now describe your requested changes.
zh_hans: 已连接提供商「%@」。你现在可以描述要改的网页需求。
zh_hk: 已連接提供商「%@」。你現在可以描述要改的網頁需求。

# chat.system.request_cancelled
source: Request cancelled.
zh_hans: 已取消本次请求。
zh_hk: 已取消本次請求。

# chat.system.thread_created
source: Created and switched to a new thread.
zh_hans: 已创建并切换到新线程。
zh_hk: 已創建並切換到新線程。

# chat.system.thread_switched.message_format
source: Switched to thread "%@".
zh_hans: 已切换到线程「%@」。
zh_hk: 已切換到線程「%@」。

# chat.thinking.disabled
source: Off
zh_hans: 关闭
zh_hk: 關閉

# chat.thinking.enabled
source: On
zh_hans: 开启
zh_hk: 開啟

# chat.thread.button_title
source: Threads
zh_hans: 线程
zh_hk: 線程

# chat.title
source: AI Chat
zh_hans: AI 聊天
zh_hk: AI 聊天

# checkpoint_list.action.restore
source: Restore
zh_hans: 恢复
zh_hk: 恢復

# checkpoint_list.alert.restore_failed.title
source: Restore Failed
zh_hans: 恢复失败
zh_hk: 恢復失敗

# checkpoint_list.alert.restore.message_format
source: Restore all files to the state at this checkpoint? %@ This action cannot be undone.
zh_hans: 将所有文件恢复到此检查点的状态？ %@ 此操作不可撤销。
zh_hk: 將所有檔案恢復到此檢查點的狀態？ %@ 此操作不可撤銷。

# checkpoint_list.alert.restore.title
source: Restore Checkpoint?
zh_hans: 恢复检查点？
zh_hk: 恢復檢查點？

# checkpoint_list.alert.restored.message
source: All files have been restored to the selected checkpoint.
zh_hans: 所有文件已恢复到所选检查点。
zh_hk: 所有檔案已恢復到所選檢查點。

# checkpoint_list.alert.restored.title
source: Restore Complete
zh_hans: 恢复完成
zh_hk: 恢復完成

# checkpoint_list.empty
source: No checkpoints yet.
zh_hans: 暂无检查点。
zh_hk: 暫無檢查點。

# checkpoint_list.title
source: Checkpoints
zh_hans: 检查点
zh_hk: 檢查點

# checkpoint.action.undo
source: Undo Last Change
zh_hans: 撤销上次更改
zh_hk: 撤銷上次變更

# checkpoint.alert.undo_done.message
source: All files have been reverted to their previous state.
zh_hans: 所有文件已还原到之前的状态。
zh_hk: 所有檔案已還原到之前的狀態。

# checkpoint.alert.undo_done.title
source: Undo Complete
zh_hans: 撤销完成
zh_hk: 撤銷完成

# checkpoint.alert.undo_failed.title
source: Undo Failed
zh_hans: 撤销失败
zh_hk: 撤銷失敗

# checkpoint.alert.undo.message
source: This will revert all files to their state before the last AI conversation. This action cannot be undone.
zh_hans: 将还原所有文件到上次 AI 对话前的状态。此操作不可撤销。
zh_hk: 將還原所有檔案到上次 AI 對話前的狀態。此操作不可撤銷。

# checkpoint.alert.undo.title
source: Undo Last Change?
zh_hans: 撤销上次更改？
zh_hk: 撤銷上次變更？

# common.action.cancel
source: Cancel
zh_hans: 取消
zh_hk: 取消

# common.action.close
source: Close
zh_hans: 关闭
zh_hk: 關閉

# common.action.delete
source: Delete
zh_hans: 删除
zh_hk: 刪除

# common.action.done
source: Done
zh_hans: 完成
zh_hk: 完成

# common.action.edit
source: Edit
zh_hans: 编辑
zh_hk: 編輯

# common.action.exit
source: Exit
zh_hans: 退出
zh_hk: 退出

# common.action.ok
source: OK
zh_hans: 确认
zh_hk: 確認

# common.action.open
source: Open
zh_hans: 打开
zh_hk: 打開

# common.action.save
source: Save
zh_hans: 保存
zh_hk: 保存

# file_browser.action.create_folder
source: New Folder
zh_hans: 新建文件夹
zh_hk: 新建資料夾

# file_browser.action.delete
source: Delete
zh_hans: 删除
zh_hk: 刪除

# file_browser.action.move
source: Move to…
zh_hans: 移动到…
zh_hk: 移動到…

# file_browser.action.rename
source: Rename
zh_hans: 重命名
zh_hk: 重新命名

# file_browser.action.upload_file
source: Upload Files
zh_hans: 上传文件
zh_hk: 上傳檔案

# file_browser.alert.load_failed.title
source: Load Failed
zh_hans: 读取失败
zh_hk: 讀取失敗

# file_browser.alert.zip_failed.title
source: Export Failed
zh_hans: 导出失败
zh_hk: 匯出失敗

# file_browser.create_folder.placeholder
source: Folder name
zh_hans: 文件夹名称
zh_hk: 資料夾名稱

# file_browser.delete.confirm.message
source: This action cannot be undone.
zh_hans: 此操作不可撤销。
zh_hk: 此操作無法撤銷。

# file_browser.delete.confirm.title
source: Delete "%@"?
zh_hans: 删除「%@」？
zh_hk: 刪除「%@」？

# file_browser.empty_directory
source: This directory is empty
zh_hans: 当前目录为空
zh_hk: 當前目錄為空

# file_browser.error.invalid_name
source: Invalid file name.
zh_hans: 文件名无效。
zh_hk: 檔案名稱無效。

# file_browser.error.move_into_self
source: Cannot move a folder into itself.
zh_hans: 无法将文件夹移动到自身内部。
zh_hk: 無法將資料夾移動到自身內部。

# file_browser.error.operation_failed
source: Operation Failed
zh_hans: 操作失败
zh_hk: 操作失敗

# file_browser.export.error.invalid_app_data_directory
source: AppData exists but is not a directory.
zh_hans: AppData 存在但不是目录。
zh_hk: AppData 存在但不是目錄。

# file_browser.export.error.missing_app_directory
source: App folder is missing and cannot be exported.
zh_hans: App 文件夹不存在，无法导出。
zh_hk: App 資料夾不存在，無法匯出。

# file_browser.export.error.missing_project_root
source: This project backup is only available from a project workspace.
zh_hans: 此项目备份仅可在项目工作区中使用。
zh_hk: 此項目備份僅可在項目工作區中使用。

# file_browser.hidden_tag
source: [hidden]
zh_hans: [隐藏]
zh_hk: [隱藏]

# file_browser.item.file
source: File
zh_hans: 文件
zh_hk: 文件

# file_browser.item.folder
source: Folder
zh_hans: 文件夹
zh_hk: 文件夾

# file_browser.move.select_directory
source: Select
zh_hans: 选择
zh_hk: 選擇

# file_browser.rename.placeholder
source: New name
zh_hans: 新名称
zh_hk: 新名稱

# file_browser.title.root_format
source: %@ Files
zh_hans: %@ 文件
zh_hk: %@ 文件

# file_browser.upload.conflict_folder.title
source: "%@" conflicts with an existing folder and was skipped.
zh_hans: 「%@」与已有文件夹同名，已跳过。
zh_hk: 「%@」與已有資料夾同名，已跳過。

# file_browser.upload.overwrite.replace
source: Replace
zh_hans: 替换
zh_hk: 替換

# file_browser.upload.overwrite.title
source: "%@" already exists. Replace it?
zh_hans: 「%@」已存在，是否替换？
zh_hk: 「%@」已存在，是否替換？

# file_viewer.alert.save_failed.title
source: Save Failed
zh_hans: 保存失败
zh_hk: 保存失敗

# file_viewer.error.non_utf8
source: This file is not UTF-8 text and cannot be edited yet.
zh_hans: 该文件不是 UTF-8 文本，暂不支持编辑。
zh_hk: 該文件不是 UTF-8 文本，暫不支持編輯。

# file_viewer.error.read_failed.message_format
source: Read failed: %@
zh_hans: 读取失败：%@
zh_hk: 讀取失敗：%@

# file_viewer.error.unsafe_path
source: Unsafe file path. Cannot read.
zh_hans: 不安全的文件路径，无法读取。
zh_hk: 不安全的文件路徑，無法讀取。

# home.add_project.title
source: New Project
zh_hans: 新项目
zh_hk: 新項目

# home.alert.create_failed.title
source: Create Failed
zh_hans: 新建失败
zh_hk: 新建失敗

# home.alert.delete_failed.title
source: Delete Failed
zh_hans: 删除失败
zh_hk: 刪除失敗

# home.alert.delete.message_format
source: Are you sure you want to delete "%@"?
zh_hans: 确定删除「%@」吗？
zh_hk: 確定刪除「%@」嗎？

# home.alert.delete.title
source: Delete Project
zh_hans: 删除项目
zh_hk: 刪除項目

# home.alert.export_failed.title
source: Export Failed
zh_hans: 导出失败
zh_hk: 匯出失敗

# home.alert.import_failed.title
source: Import Failed
zh_hans: 导入失败
zh_hk: 導入失敗

# home.empty.default
source: No web projects yet. Tap + at top right to create your first one.
zh_hans: 还没有网页项目，点击右上角 + 创建第一个吧。
zh_hk: 還沒有網頁項目，點擊右上角 + 創建第一個吧。

# home.empty.no_match
source: No matching projects. Try another keyword.
zh_hans: 没有匹配的项目，换个关键词试试。
zh_hk: 沒有匹配的項目，換個關鍵詞試試。

# home.menu.export
source: Export
zh_hans: 导出
zh_hk: 匯出

# home.menu.export.doufu.subtitle
source: Code only
zh_hans: 仅代码
zh_hk: 僅程式碼

# home.menu.export.doufull.subtitle
source: Code and data
zh_hans: 代码和数据
zh_hk: 程式碼和資料

# home.menu.import_project
source: Import Project
zh_hans: 导入项目
zh_hk: 導入項目

# home.menu.settings
source: Settings
zh_hans: 设置
zh_hk: 設置

# home.project.activity.building
source: Building
zh_hans: 正在建造中
zh_hk: 正在建造中

# home.project.activity.error
source: Error
zh_hans: 出错了
zh_hk: 出錯了

# home.project.activity.needs_confirmation
source: Needs Confirmation
zh_hans: 需要确认
zh_hk: 需要確認

# home.project.activity.new_version
source: New Version
zh_hans: 新版本
zh_hk: 新版本

# home.project.no_description
source: No description
zh_hans: 暂无描述
zh_hk: 暫無描述

# home.search.placeholder
source: Search projects
zh_hans: 搜索项目
zh_hk: 搜索項目

# home.title
source: Doufu
zh_hans: 豆腐
zh_hk: 豆腐

# import.error.access_denied
source: Cannot access the selected file.
zh_hans: 无法访问所选文件。
zh_hk: 無法存取所選檔案。

# import.error.copy_failed
source: Failed to read the selected archive.
zh_hans: 无法读取所选归档文件。
zh_hk: 無法讀取所選封存檔案。

# import.error.invalid_structure
source: Archive structure is invalid.
zh_hans: 归档文件结构无效。
zh_hk: 封存檔案結構無效。

# import.error.invalid_zip
source: Invalid archive: %@
zh_hans: 无效的归档文件：%@
zh_hk: 無效的封存檔案：%@

# import.error.multiple_files.message
source: Only one archive can be imported at a time. The first file will be imported.
zh_hans: 一次只能导入一个归档文件，将导入第一个文件。
zh_hk: 一次只能匯入一個封存檔案，將匯入第一個檔案。

# import.error.multiple_files.title
source: Multiple Files
zh_hans: 多个文件
zh_hk: 多個檔案

# import.error.unsupported_extension
source: Unsupported file extension: .%@.
zh_hans: 不支持的文件扩展名：.%@。
zh_hk: 不支援的副檔名：.%@。

# import.error.unsupported_zip_feature
source: Unsupported ZIP feature: %@
zh_hans: 不支持的 ZIP 特性：%@
zh_hk: 不支援的 ZIP 特性：%@

# llm.error.invalid_gemini_url
source: Request failed: invalid Gemini URL.
zh_hans: 请求失败：Gemini URL 无效。
zh_hk: 無效的 Gemini API 網址。

# llm.error.invalid_response
source: Request failed: invalid response.
zh_hans: 请求失败：无效响应。
zh_hk: 伺服器返回了無效的回應格式。

# llm.error.request_failed
source: Request failed. Please try again.
zh_hans: 请求失败，请重试。
zh_hk: 請求失敗，請檢查網路連線。

# llm.error.request_failed_format
source: Request failed: %@
zh_hans: 请求失败：%@
zh_hk: 請求失敗：%@

# llm.error.request_timeout
source: Request timed out. Please try again.
zh_hans: 请求超时，请重试。
zh_hk: 請求超時，請稍後重試。

# llm.error.response_failed
source: Response failed.
zh_hans: 响应失败。
zh_hk: 無法讀取伺服器回應。

# llm.error.response_incomplete
source: Response incomplete.
zh_hans: 响应不完整。
zh_hk: 伺服器回應不完整。

# llm.error.stream_failed
source: Streaming response failed.
zh_hans: 流式响应失败。
zh_hk: 流式回應中斷。

# message_detail.title
source: Detail
zh_hans: 详情
zh_hk: 詳情

# model_config.action.detail
source: Detail
zh_hans: 详情
zh_hk: 詳情

# model_config.alert.refresh_failed
source: Refresh Failed
zh_hans: 刷新失败
zh_hk: 重新整理失敗

# model_config.alert.save_failed
source: Save Failed
zh_hans: 保存失败
zh_hk: 儲存失敗

# model_config.inherit.use_app_default
source: Use App Default
zh_hans: 使用App默认
zh_hk: 使用App預設

# model_config.inherit.use_project_default
source: Use Project Default
zh_hans: 使用项目默认
zh_hk: 使用專案預設

# model_config.manage.add_custom_model
source: Add Custom Model
zh_hans: 添加自定义模型
zh_hk: 新增自訂模型

# model_config.manage.add_custom_model_subtitle
source: Register a model that is not returned by the provider API.
zh_hans: 注册供应商 API 未返回的模型。
zh_hk: 註冊供應商 API 未傳回的模型。

# model_config.manage.refresh_models
source: Refresh Official Models
zh_hans: 刷新官方模型
zh_hk: 重新整理官方模型

# model_config.manage.refresh_models_subtitle
source: Pull the latest model list from the provider API.
zh_hans: 从供应商 API 拉取最新模型列表。
zh_hk: 從供應商 API 拉取最新模型列表。

# model_config.manage.refreshing_models
source: Refreshing Official Models...
zh_hans: 正在刷新官方模型…
zh_hk: 正在重新整理官方模型…

# model_config.section.manage_models
source: Manage Models
zh_hans: 管理模型
zh_hk: 管理模型

# model_config.section.model.footer
source: Swipe left on a model to edit or view details.
zh_hans: 向左滑动模型可编辑或查看详情。
zh_hk: 向左滑動模型可編輯或檢視詳情。

# model_config.source.custom
source: Custom
zh_hans: 自定义
zh_hk: 自訂

# model_config.source.official
source: Official
zh_hans: 官方
zh_hk: 官方

# model_config.thinking_required
source: Thinking (required)
zh_hans: 思考（必需）
zh_hk: 思考（必需）

# model_discovery.error.invalid_response
source: Request failed: invalid response.
zh_hans: 请求失败：无效响应。
zh_hk: 請求失敗：無效回應。

# model_discovery.error.request_failed_format
source: Request failed: %@
zh_hans: 请求失败：%@
zh_hk: 請求失敗：%@

# oauth.callback.bad_request
source: Bad Request
zh_hans: 请求无效
zh_hk: 請求無效

# oauth.callback.login_complete.body
source: You can return to Doufu now.
zh_hans: 你现在可以返回 Doufu。
zh_hk: 你現在可以返回 Doufu。

# oauth.callback.login_complete.title
source: Login complete
zh_hans: 登录完成
zh_hk: 登錄完成

# oauth.callback.not_found
source: Not Found
zh_hans: 未找到页面
zh_hk: 未找到頁面

# oauth.error.already_running
source: Sign-in flow is already running.
zh_hans: 登录流程已在进行中。
zh_hk: 登錄流程已在進行中。

# oauth.error.bearer_fetch_prefix
source: Failed to fetch Bearer Token
zh_hans: Bearer Token 获取失败
zh_hk: Bearer Token 獲取失敗

# oauth.error.bearer_missing_org
source: Failed to fetch Bearer Token: organization_id is missing in account info. Please ensure your account has OpenAI Platform access and try again.
zh_hans: Bearer Token 获取失败：登录信息缺少 organization_id。请确认账号已开通 OpenAI Platform 并重试。
zh_hk: Bearer Token 獲取失敗：登錄信息缺少 organization_id。請確認賬號已開通 OpenAI Platform 並重試。

# oauth.error.callback_missing_code
source: Authorization code missing in callback.
zh_hans: 登录回调缺少授权码。
zh_hk: 登錄回調缺少授權碼。

# oauth.error.callback_server_start_failed
source: Failed to start local callback server. Please try again later.
zh_hans: 无法启动本地回调服务，请稍后重试。
zh_hk: 無法啓動本地回調服務，請稍後重試。

# oauth.error.callback_state_mismatch
source: Sign-in verification failed (state mismatch).
zh_hans: 登录校验失败（state mismatch）。
zh_hk: 登錄校驗失敗（state mismatch）。

# oauth.error.cancelled
source: Sign-in cancelled.
zh_hans: 登录已取消。
zh_hk: 登錄已取消。

# oauth.error.invalid_state
source: Invalid sign-in state. Please try again.
zh_hans: 登录状态无效，请重试。
zh_hk: 登錄狀態無效，請重試。

# oauth.error.no_bearer_after_login
source: Signed in successfully, but no usable Bearer Token was obtained.
zh_hans: 登录成功，但未获取到可用的 Bearer Token。
zh_hk: 登錄成功，但未獲取到可用的 Bearer Token。

# oauth.error.prefixed_invalid_response_format
source: %@: Invalid service response.
zh_hans: %@：服务响应无效。
zh_hk: %@：服務響應無效。

# oauth.error.prefixed_parse_failed_format
source: %@: Failed to parse response.
zh_hans: %@：响应解析失败。
zh_hk: %@：響應解析失敗。

# oauth.error.token_exchange_prefix
source: Failed to exchange authorization code for token
zh_hans: 授权码换取 token 失败
zh_hk: 授權碼換取 token 失敗

# orchestrator.done
source: Done.
zh_hans: 已完成。
zh_hk: 已完成。

# orchestrator.max_iterations_reached
source: Maximum execution steps reached. Please send another message to continue.
zh_hans: 已达到最大执行步骤数。请再发一条消息继续。
zh_hk: 已達到最大執行步驟數。請再發一條訊息繼續。

# orchestrator.max_iterations_suffix
source: (Maximum execution steps reached)
zh_hans: （已达到最大执行步骤数）
zh_hk: （已達到最大執行步驟數）

# orchestrator.thinking
source: Thinking…
zh_hans: 正在思考…
zh_hk: 正在思考…
